using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace StarshaySestra
{
   public static class ResponseToUser
    {
        public static string ComplexRelationship = "Наше  человечество существует столько тысяч лет\U0001f996, а непонимание между старшими и младшими осталось до сих пор.\r\nВ чем бы ни проявлялось непонимание родителей — разговаривай с ними❗️ Спрашивай" +
            " у них о том, почему они видят лишь один выход, и чем, по их мнению, плох твой.Для начала нужно понять их отношение к твоему мнению❗️ Один человек может не понимать другого только тогда, когда не хочет понимать. Если хочет — постарается и пойдет" +
            " навстречу. Выделим 3 варианта развития событий:\r\n\r\n📍Если родитель не хочет понять и не понимает — это одно.\r\n\r\n📍Если он имеет иную позицию по вопросу — это другое. Родитель может прекрасно тебя понимать, но иметь другую точку зрения, " +
            "на которую он (как и ты)  имеет право. Это нормально. Это не про непонимание.\r\n\r\n📍Если родитель хочет наставить, помочь, защитить, уберечь, воспитать — это третье. Здесь родитель также может тебя понимать, но его обязанности  обязывают его не" +
            " соглашаться с тобой.Если тебе ближе второй или третий вариант, тогда разрушающие мысли о том, что родители тебя не понимают уже не  актуальны. Когда ты перестанешь воспринимать их как непонимающих, твои эмоции, твоё восприятие ситуации успокоятся, " +
            "тебе сразу станет легче\U0001fac2.";

        public static string ComplexRelationship1 = "Если подходящим оказался первый вариант, тогда нужно постараться донести до родителей свою позицию. Только не на эмоциях❗️ Ведь тогда родитель не воспримет твои аргументы серьёзно, а, скорее всего, спишет всё на " +
            "твои эмоции, возраст, капризы, отсутствие опыта и т.д.\r\nПопробуйте поговорить с ними спокойно,в непринужденной обстановке,попросите у родителей определенное время на обьяснение⏰.Расскажите почему это вам важно.Попроси их внимательно тебя выслушать." +
            " Отстаивай спокойно своё право на свою позицию, если тебя будут перебивать. Остановись, попроси ещё раз, продолжай. Бывает, что родители всё-таки не слышат, перебивают. Сохраняй спокойствие, всё-таки родители — не деревянные «буратины», которые не хотят" +
            " ничего слышать. Возможно, такой подход будет отличаться от того, что ты делала раньше и поможет тебе достучаться до родителей.";

        public static string Divorce = "Развод родителей — дело неприятное, но и нередкое в наши дни.Прекрасно, когда вся семья живет дружно вместе.Но часто случается так, что папа и мама" +
                            " решают жить отдельно. И этот вовсе не значит, что кто-то из них прекратил вас любить." +
                            " Развод это решение двух взрослых людей вы в этои не виноваты и ею не являетесь. И вашей вины в их разводе нет\U0001fac2. Не забывай что ..\r\n\r\n📍 Даже в разводе вы сможете легко общаться с обоими родителями, " +
                            "есть много разных мессенджеров — вотсап, телеграм. Продолжайте с ними общаться как  и раньше. Нужен совет от папы или от мамы — спрашивайте, как и прежде.Ваши родители просто перестали быть мужем и женой, но ни остались" +
                            " вашими   родителями.\r\n📍 Если вы единственный ребенок скорее всего, вы сейчас станете «любимчиком» обоих родителей, и каждый из них попробует «перетянуть» тебя на свою  сторону. Не играйтесь в эту игру. У вас своя игра, " +
                            "своя жизнь, свой план. Принимай их подарки легко, сочувствуй, будь дружелюбной, но не пытайся  угодить, быть «папенькиной» или «маменькиной» дочкой. Помните, что ваши папа и мама — обыкновенные люди со своими проблемами," +
                            " со своими  «тараканами» в голове. Вы останетесь их дочкой/сыном,со своими планами на жизнь.То, что они вам рассказали о разводе, уже значит, что они с вами  считаются и верят, что ты — сильная и справишься с этим.\r\n📍 " +
                            "Оставьте ответственность за происходящее родителям. Они взрослые люди и могут сами нести ответственность за свои отношения и решения. Даже если  они примут решение развестись, это будет их выбор и их история отношений." +
                            " Попробуйте посмотреть на эту ситуацию со стороны и принять то, что они как  взрослые люди должны пережить и разобраться в этом самостоятельно\U0001faf6🏻.";

        public static string Safe = "Социальная сеть – социальная структура, объединяющая людей с одинаковыми интересами, предпочтениями, или просто для общения и поиска новых знакомств.Сети уже давно " +
                     "стали незаменимым помощником современного человека👩🏻‍💻.\r\nВ сети вы можете общаться с одним кликом общаться с человеком на другом конце мире, или же купить вещь которую вы давно хотели,и еще очень много другого.  \r\n В связи " +
                     "с развитием информационных технологий стало появляться все больше угроз безопасности в сети такие как киберсталкинг,фишеры,получение личных данных,киберзапугивание,кибербуллинг итд,этих терминов очень много, продолжать можно вечно." +
                     "Вот вам основные правила:\r\n📌 Не стоит встречаться с людьми из интернета, с которыми вы знакомы очень мало или же все таки собираетесь то возьмите кого-нибудь со собой кому доверяете.  \r\n📌 Не стоит заходит на ссылки которые вам " +
                     "отправил неизвестный номер. \r\n📌 Если неуверенны не вводите свои данные на непонятных сайтах. \r\n📌 Не давайте скачивать файлы,веб-приложения итд,без вашего разрешения.  \r\n📌 Не писать в сетях о себе очень много информации," +
                     "так как эту информацию могут использовать против вас же. \r\n\r\n\r\n";

        public static string Filtr = "В современном мире социальные медиа стали неотъемлемой частью нашей повседневной жизни🤳🏻. Одной из самых популярных платформ является Instagram.У красивой истаграмной жизни" +
                            " две стороны медали🏅. В реальности между снимками на Instagram происходят обычные повседневные события и проблемы. Люди испытывают различные эмоции, сталкиваются с трудностями и переживают неудачи🎭, но часто они не показывают это в" +
                            " своих постах. Это может создать иллюзию идеальной жизни, в которой все всегда счастливы и успешны.Важно помнить, что Instagram представляет лишь небольшую часть нашей жизни.За яркими фотографиями скрываются истории, которые не всегда " +
                            "показываются публично. Большая часть нашей жизни происходит вне кадра," +
                            " в моментах, которые мы не делимся со всем миром.Та жизнь которую вы проживаете сейчас лучшая🫂.";


        public static string Protected = "Методы защиты\r\n\r\nБезопасный секс – это секс, при котором риск заражения ВИЧ и инфекциями💉, передающимися половым путем(ИППП), минимален.\r\nПри таком сексе меньше" +
                            " оснований для беспокойства, и можно сосредоточиться на том, что приятно и хорошо. Обеспечить безопасный секс легче, если подготовиться заранее и обдумать, \r\nкак проявить заботу о себе самом и о своем партнере по сексу.Контрацепция — " +
                            "это предотвращение беременности механическими,химическими или другими противозачаточными способами и средствами.\r\nНиже разберем основные методы⬇️.\r\nМетоды контрацепции:\r\n📌 Гормональная контрацепция, (самыми распространенными являются" +
                            " таблетки, пластыри, вагинальное кольцо).\r\n📌 Внутриматочные контрацептивы: обычные спираль, гормональная спираль.(Спираль вводится врачом в полость матки и физически препятствует проникновению  сперматозоидов в матку, не допуская " +
                            "оплодотворения)\r\n📌 Барьерный и спермицидный методы контрацепции: презерватив, спермициды (химические вещества в виде свечей, таблеток, гелей,пенок, которые разрушают  сперматозоиды).\r\n📌 Метод планирования: календарный метод(" +
                            " высчитывание опасных и безопасных дней в менструальном цикле),прерванный половой акт, метод лактационной аменореи(для женщин, кормящих грудью)";

        public static string SexEducation = "Половое образование \r\n\r\n📚Половое просвещение — это обучение вопросам, касающимся человеческой сексуальности, включая эмоциональные отношения и обязанности в отношениях с " +
            "половым партнёром,\r\nрепродуктивную систему, сексуальную активность, половое размножение, возраст согласия, репродуктивное и сексуальное здоровье, репродуктивные права, \r\nсредства контрацепции и безопасный секс." +
            "\r\nНежелание родителей, испытывающих стыд и дискомфорт, обсуждать темы, связанные с сексом, приводят к тому, что подростки ищут ответы в Интернете📱. \r\nИ что они там находят? Неверную и вводящую в заблуждение информацию." +
            " Яркий пример этого – порнография. Поэтому критически важно, чтобы дети получали эту, без шуток, \r\nжизненно важную информацию из надёжных проверенных источников, будь то подготовленные учителя и специально обученные" +
            " психологи – а не из телевизионных шоу📺, художественных или порнографических фильмов и россказней таких же неопытных салаг.";

        public static string SexEducation1 = "Иногда под давлением сверстников дети могут совершать опрометчивые поступки, особенно это касается первого секса. \r\nУслышав разговоры друзей или уговоры своего партнера, подросток может поддаться общественному мнению и сделать то," +
            " что не хочет❌.\r\nЧтобы предотвратить подобную ситуацию, родителям нужно заранее объяснить, что если мальчик или девочка не готовы начать половую жизнь, то они и не должны этого делать. \r\nИли если их партнер пока не хочет переходить на новый уровень в отношениях, " +
            "то не нужно настаивать, лучше принять и поддержать его.﻿Но ни в коем случае нельзя терпеть нарушение своих личных границ кем бы то ни было. Если неприятны прикосновения человека, его слова, действия, это всегда следует прекращать, и об этом нужно говорить с детства.";

        public static string SexEducation2 = "Еще в раннем возрасте дети начинают интересоваться своим телом, в том числе и половыми органами. Многие родители пугаются, когда видят, что дети трогают себя в интимных местах,и считают" +
            " это недопустимым. Но психологи уверяют👩🏻‍⚕️, что изучать свое тело абсолютно нормально, просто нужно рассказать, что этот процесс не нуждается в свидетелях.\r\nЛюди не любят разговаривать на эту тему, но она заслуживает " +
            "внимания. Столкнуться с насилием может каждый и в любом возрасте.\r\nПоловое насилие наносит травму не только сексуальности человека, но и всей его личности. В таком случае речь идет не о сексе, \r\nа о применении силы." +
            " Никто от этого не застрахован. \r\nПоловое насилие оставляет след на всю жизнь. К сожалению, лишь небольшая часть жертв полового насилия обращается за помощью. Как ко мне после этого будут относиться? \r\nХватит ли мне" +
            " сил пройти расследование и судебный процесс? Поверят ли мне? Если насилие произошло в детстве или ранней юности, у преступления зачастую уже вышел срок давности.\r\nНо жертва никогда не виновата. Как может быть виноват " +
            "маленький беспомощный ребенок, к которому применили силу? Которого угрозами заставляют молчать? \r\nИногда утверждается, что ребенок врет. Но как ребенок вообще может выдумать что-то, похожее на половое насилие?";




        public static string Period = "Месячные \r\n\r\n❗️«У меня идет кровь, потому что у меня менструация. Это не болезнь и это не опасно»❗️.\r\n\r\nМенструация — это естественный процесс, который является частью физиологии половины населения нашей планеты🌏.\r\nДелать вид," +
            " что его не существует, пытаться его спрятать или выставить как что‑то постыдное, — вредно со всех сторон, и с психической, и с физиологической.\r\nЕсли у вас есть менструальные боли, то можно прямо объяснить причину плохого самочувствия:живот или голова болит" +
            " у женщин во время менструации; это некомфортно, но само по себе не является признаком болезни.\r\nТо же самое: если вы замечает пятна крови на одежде или видите использованные средства личной гигиены, в этой ситуации будет правильно назвать все своими именами" +
            ".\r\nСегодня в мире существует огромный выбор самых разных средств менструальной гигиены и у каждой женщины и молодой девушки есть возможность выбрать именно то, что удобно лично ей.";
        public static string Period1 = "Самое главное нужно ориентироваться нужно в первую очередь на свой комфорт\U0001fac2." +
            " \r\nРазумеется, самый понятный и проверенный временем продукт — это прокладки. А также есть тампоны, менструальные чаши или чаши. " +
            "Пользоваться ими можно даже если вы не начали жить половой жизнью. \r\nОбязательно нужно помнить о том, что любые средства гигены нужно менять каждые 4 часа, " +
            "чтобы избежать раздражения кожи, неприятного запаха и распространения бактерий. \r\nЧто касается продолжительности менструации, в среднем нормой считается срок до 8 дней.\r\nУ юных " +
            "" +
            "девушек цикл неустойчив. Первая менструация может прийти в возрасте от 8 до 15 лет, а в среднем чаще всего случается в 12–13 лет. \r\nЕсли менструация не наступила после 15 лет или" +
            " началась до 8, это веский повод обратиться к гинекологу👩🏻‍⚕️. \r\nЧто касается о длительности цикла:в первый год может быть разный промежуток это нормально, так как организм" +
            " адаптируется к гормональным изменениям.В течении 3 лет с начала от придет в свою норму⚖️.";

        public static string SortOfAbuse = "Виды насилия:\r\n\r\nПредоставляем вам общую информацию о виды психологического насилия.\r\nПсихологическое насилие, также известное как эмоциональное насилие🤕, может принимать различные формы. Вот некоторые из них:\r\n📌Вербальное насилие: оскорбления, унижения, критика, насмешки" +
            "" +
            " и пренебрежительные замечания.\r\n\r\n📌Манипуляция: использование ложи, обмана или угроз для контроля над другим человеком.\r\n\r\n📌Изоляция: ограничение контактов с друзьями, семьей или коллегами, чтобы усилить контроль над человеком.\r\n\r\n📌Газлайтинг: психологическая манипуляция, при которой жертва " +
            "заставляется сомневаться в своей реальности, памяти или восприятии.\r\n\r\n📌Экономическое насилие: контроль над финансами жертвы, ограничение доступа к деньгам или работе.\r\n\r\n📌Сталкинг: нежелательное преследование, слежка или навязчивое внимание, вызывающее страх или тревогу у жертвы.\r\n\r\n📌Цифровое насилие: " +
            "использование технологий, таких как интернет, социальные сети или мобильные телефоны, для контроля, угроз, шантажа или унижения жертвы.\r\n\r\nЕсли вы или кто-то, кого вы знаете, сталкивается с психологическим насилием, рекомендуется обратиться за помощью к профессионалам, таким как психологи, социальные работники или " +
            "правоохранительные органы.";
        public static string Soulmate = "💚Здоровье - это полное благополучие тела, души и общества. Стресс негативно влияет на здоровье, вызывая психосоматически заболевания.\r\nПсихические расстройства включают невротические, тревожные, депрессивные, афективные и психосоматические нарушения.\r\nПредупреждение стрессов -" +
            " лучшее средство борьбы с ними. Необходимо находить время для отдыха, снижать потребление стимуляторов, заниматься спортом,\r\nобращаться за помощью к специалистам, ставить перед собой четкие цели и уметь отвлекаться от негативных мыслей🔋.\r\nМассаж, акупунктура(Китайская медицина), визуализация, гимнастика, медитация," +
            " дыхательные упражнения и водные процедуры также помогают.\r\nСмех является лучшим лекарством(ха-ха-ха).";
















   }

}
