namespace StarshaySestra
{
    public static  class TextConstants
    {
        public static string MainDisclaimer = "ДИСКЛЕЙМЕР\r\n  📍Если вы чувствуете, что вам " +
                            "нужна помощь, пожалуйста, обратитесь за поддержкой к профессионалам,\r\nтаким как психологи," +
                            " социальные работники или юристы. Они могут помочь вам получить необходимую помощь и защиту." +
                            " \r\nЯ хочу подчеркнуть, что насилие никогда не является вашей виной, \r\nи что вы заслуживаете" +
                            " любви, уважения и безопасности. \r\nНикто не заслуживает жить в страхе и боли, и я надеюсь," +
                            " \r\nчто вы найдете силы и ресурсы, чтобы выйти из этой ситуации.\r\n\r\n";

        public static string ParentsRelationships = "ДИСКЛЕЙМЕР\r\n  📍Отношения детей и взрослых родителей основываются на любви, " +
                            "уважении и общих интересах. Только при наличии этих составляющих можно достигнуть гармонии и взаимопонимания. Однако, в жизни ситуация часто" +
                            " выглядит иначе: непонимание, взаимные претензии приводят к конфликтам, провоцируют скандалы. Ответственность за отношения в равной степени " +
                            "лежит на обеих сторонах, поэтому работать над улучшением должны и дети, и родители одновременно. Мириться, замалчивать проблему неправильно, " +
                            "конфликт лучше уладить на стадии зарождения, пока не будет слишком поздно.";
    }
}
