namespace StarshaySestra
{
    public static  class TextConstants
    {
        public static string MainDisclaimer = "ДИСКЛЕЙМЕР\r\n  📍Если вы чувствуете, что вам " +
                            "нужна помощь, пожалуйста, обратитесь за поддержкой к профессионалам,\r\nтаким как психологи," +
                            " социальные работники или юристы. Они могут помочь вам получить необходимую помощь и защиту." +
                            " \r\nЯ хочу подчеркнуть, что насилие никогда не является вашей виной, \r\nи что вы заслуживаете" +
                            " любви, уважения и безопасности. \r\nНикто не заслуживает жить в страхе и боли, и я надеюсь," +
                            " \r\nчто вы найдете силы и ресурсы, чтобы выйти из этой ситуации.\r\n\r\n";

        public static string ParentsRelationships = "ДИСКЛЕЙМЕР\r\n  📍Отношения детей и взрослых родителей основываются на любви, " +
                            "уважении и общих интересах. Только при наличии этих составляющих можно достигнуть гармонии и взаимопонимания. Однако, в жизни ситуация часто" +
                            " выглядит иначе: непонимание, взаимные претензии приводят к конфликтам, провоцируют скандалы. Ответственность за отношения в равной степени " +
                            "лежит на обеих сторонах, поэтому работать над улучшением должны и дети, и родители одновременно. Мириться, замалчивать проблему неправильно, " +
                            "конфликт лучше уладить на стадии зарождения, пока не будет слишком поздно.";



        public static string Insagram = "ДИСКЛЕЙМЕР\r\n  📍Социальная сеть – социальная структура, объединяющая людей с одинаковыми интересами, предпочтениями, или просто для общения" +
                                     " и поиска новых знакомств.\r\n Основная цель создания социальных сетей – общение людей между собой. Несмотря на положительные стороны социальных сетей, есть" +
                                   " определенные недостатки: " + "\r\n сети переполнены ненужной информацией,а также связи с развитием технологий повысился уровень киберпреступности в сети.\r\n";

        public static string Seks = "ДИСКЛЕЙМЕР\r\n  📍Здесь мы бы хотели обсудить тему полового воспитания, путь о том что такое месячные до представление " +
                            "что такое безопасный секс.\r\nХотелось бы сказать что месячные как и секс естественные вещи и о них нужно говорить, в этом нет никакого \"уят\"";

        public static string Abuser = "ДИСКЛЕЙМЕР\r\n 📍Физическое, психическое и душевное состояние - три важных аспекта благополучия. Обратите внимание на себя и заботьтесь о них.\r\n";


        public static string Phone = "ГОРЯЧИЕ ЛИНИИ☎️\r\n\r\n 📞   117 - Для пострадавших от домашнего насилия\r\n\r\n 📞    1222 - Телефон единой горячей линии\r\n\r\n 📞 (0312) 51-26-40 - Горячая линия Кризисного центра <Cезим>,г.Бишкек\r\n\r\n 📞 +996312435301 - Телефон Кризисного центра <Шанс>,г.Бишкек  \r\n\r\n 📞 +996779645985 - Телефон Кризисного центра <Шанс>,г.Бишкек \r\n\r\n 📞 +996772444023 - Телефон Кризисного центра <Шанс>,г.Бишкек \r\n\r\n 📞  65-37-42 - Телефон муниципального кризисного центра \"Аялзат\" для женщин с детьми,г.Бишкек,г.Талас  \r\n 📞  0772328960 - Телефон кризисного центра  ОО «Энсан — Диамонд»,г.Ош\r\n 📞 0777393077 - Телефон кризисного центра  «Жаныл Мырза», г.Баткен \r\n 📞 0372255084 - Телефон кризисного центра  «Каниет»,г.Джалал-Абад\r\n 📞 0709694550 - Телефон кризисного центра   «Алтынай»,г. Чолпон-Ата \r\n 📞 0706383637 - Телефон кризисного центра  «Мээрман», г.Каракол";






    }

}


    

